In [43]:
import numpy as np
import pandas as pd

In [44]:
#Create 3 list viz. productId, Product Name, Product Price with 5 elements each. 
#Add this element to create a DataFrame.

In [45]:
productId=["101","102","103","104","105"]
product_name=["pen","marker","Notebook","pencil","Scissor"]
product_price=["10","20","40","10","30"]

f= {'product_Id': productId,'product_name': product_name, 'product_price': product_price}
f

{'product_Id': ['101', '102', '103', '104', '105'],
 'product_name': ['pen', 'marker', 'Notebook', 'pencil', 'Scissor'],
 'product_price': ['10', '20', '40', '10', '30']}

In [46]:

df=pd.DataFrame(f)
df

  product_Id product_name product_price
0        101          pen            10
1        102       marker            20
2        103     Notebook            40
3        104       pencil            10
4        105      Scissor            30

In [47]:
#Q2 Extract one by one column and display separately from above dataframe.

In [48]:
column1=df['product_Id']
column2=df['product_name']
column3=df['product_price']
column1,column2,column3

(0    101
 1    102
 2    103
 3    104
 4    105
 Name: product_Id, dtype: object,
 0         pen
 1      marker
 2    Notebook
 3      pencil
 4     Scissor
 Name: product_name, dtype: object,
 0    10
 1    20
 2    40
 3    10
 4    30
 Name: product_price, dtype: object)

In [49]:
#Q3 display separately each and every row from an aove dataframe.(use loc or iloc function)

In [50]:
a1=df.iloc[0]
a2=df.iloc[1]
a3=df.iloc[2]
a1,a2,a3

(product_Id       101
 product_name     pen
 product_price     10
 Name: 0, dtype: object,
 product_Id          102
 product_name     marker
 product_price        20
 Name: 1, dtype: object,
 product_Id            103
 product_name     Notebook
 product_price          40
 Name: 2, dtype: object)

In [51]:
#Q4 display product name from 3 row using loc function

In [52]:
df.loc[0:2,["product_name"]]

  product_name
0          pen
1       marker
2     Notebook

In [53]:
df.iloc[0:3,1]

0         pen
1      marker
2    Notebook
Name: product_name, dtype: object

In [54]:
#Q5 Display price Located in 2 row using iloc function

In [55]:
df.iloc[0:3,2]

0    10
1    20
2    40
Name: product_price, dtype: object

In [56]:
#Q6 Display  2nd to 4th row data excluding price.

In [57]:
df.iloc[1:5].drop(['product_price'], axis=1)

  product_Id product_name
1        102       marker
2        103     Notebook
3        104       pencil
4        105      Scissor

In [58]:
#Q7 Display 1 to 3rd row price data only

In [59]:
df.loc[3:4,['product_price']]

  product_price
3            10
4            30

In [60]:
#Q8 Change marks in python column to 41 for students who have scored less than 40.

In [61]:
data= np.array([[14,35,14],[71,24,71],[11,34,19],[82,46,99,]])
df=pd.DataFrame(data,index=['Riya','Siya','Kiya','Jiya'],columns=['Python','Data_Science','DBMS',])
df

      Python  Data_Science  DBMS
Riya      14            35    14
Siya      71            24    71
Kiya      11            34    19
Jiya      82            46    99

In [62]:
df['Python']<40

Riya     True
Siya    False
Kiya     True
Jiya    False
Name: Python, dtype: bool

In [63]:
df.loc[df.Python<40,'Python']=41
df

      Python  Data_Science  DBMS
Riya      41            35    14
Siya      71            24    71
Kiya      41            34    19
Jiya      82            46    99

In [64]:
#Q9 Add 2 marks to all the subjects marks. If any of the marks exceeds 100 chage it to 100.

In [65]:
df=df+2
df

      Python  Data_Science  DBMS
Riya      43            37    16
Siya      73            26    73
Kiya      43            36    21
Jiya      84            48   101

In [66]:
df =df.applymap(lambda x: 100 if x > 100 else x)
df

      Python  Data_Science  DBMS
Riya      43            37    16
Siya      73            26    73
Kiya      43            36    21
Jiya      84            48   100

In [67]:
#Q10 Display students who have scored more than 50 marks in Python and more than 60 marks in DataScience

In [68]:
df.loc[df.Python>50].drop(['Data_Science'],axis=1).drop(['DBMS'],axis=1)

      Python
Siya      73
Jiya      84

In [69]:
df.loc[df.Data_Science>60]

Empty DataFrame
Columns: [Python, Data_Science, DBMS]
Index: []

In [70]:
#Q11 Display students records whose name starts with letter S.

In [71]:
#Q12 Display students records whose name ends with letter a.

In [72]:
#Q13 Calculate total and percentage for all the students.

In [73]:
df['percentage']=(df['Python']+df['Data_Science']+df['DBMS'])*1/3
df

      Python  Data_Science  DBMS  percentage
Riya      43            37    16   32.000000
Siya      73            26    73   57.333333
Kiya      43            36    21   33.333333
Jiya      84            48   100   77.333333

In [74]:
#Q14 Calculate Status (Pass/Fail) for the students.

In [75]:
df.loc[df['percentage']>40,'Result']="pass"
df.loc[df['percentage']<40,'Result']="fail"
df

      Python  Data_Science  DBMS  percentage Result
Riya      43            37    16   32.000000   fail
Siya      73            26    73   57.333333   pass
Kiya      43            36    21   33.333333   fail
Jiya      84            48   100   77.333333   pass

In [76]:
#Q15 Calculate percentage based grade value (per>=90then A-grade,per>=80 then B-grade, per>=70 then C-grade, per>=60 then D-grade, per>=50 then E-grade, per<50 then F grade)

In [77]:
df.loc[df['percentage']>=90,'Grade']="A"
df.loc[df['percentage']>=80,'Grade']="B"
df.loc[df['percentage']>=70,'Grade']="C"
df.loc[df['percentage']>=60,'Grade']="D"
df.loc[df['percentage']>=50,'Grade']="E"
df.loc[df['percentage']<50,'Grade']="F"
df

      Python  Data_Science  DBMS  percentage Result Grade
Riya      43            37    16   32.000000   fail     F
Siya      73            26    73   57.333333   pass     E
Kiya      43            36    21   33.333333   fail     F
Jiya      84            48   100   77.333333   pass     E

In [78]:
#Q16 Also calculate overall columns total, maximum, minmum and standard deviation for each numeric columns

In [79]:
df.describe()

          Python  Data_Science        DBMS  percentage
count   4.000000      4.000000    4.000000    4.000000
mean   60.750000     36.750000   52.500000   50.000000
std    20.982135      8.995369   40.828911   21.623033
min    43.000000     26.000000   16.000000   32.000000
25%    43.000000     33.500000   19.750000   33.000000
50%    58.000000     36.500000   47.000000   45.333333
75%    75.750000     39.750000   79.750000   62.333333
max    84.000000     48.000000  100.000000   77.333333

In [80]:
#Q17 Display meta-data for each column for the above dataframe.

In [84]:
pd.dtype?

Object `pd.dtype` not found.

In [ ]:
#Q18 Convert the above dataframe to list within a dictionary.

In [ ]:
df.todictionary

In [45]:
#Q19 Convert this dictionary again to a separate dataframe by adding 500 to each element in product price column

In [46]:
df+500

TypeError: can only concatenate str (not "int") to str

In [47]:
#1. Import pandas as pd
import numpy as np
import pandas as pd

In [48]:
#2. Read Salaries.csv as a dataframe called sal.
df=pd.read_csv('Salaries.csv')

C:\Users\DELL\AppData\Local\Temp\ipykernel_16868\1552745546.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df=pd.read_csv('Salaries.csv')

In [49]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [50]:
#3. Check the head of the DataFrame

In [63]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [51]:
#4. Use the .info() method to find out how many entries there are.

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [52]:
#5. What is the average BasePay ?

In [68]:
df=df.replace('Not Provided',np.nan)

In [69]:
df=df.replace('Not provided',np.nan)

In [70]:
df['BasePay']=df['BasePay'].astype('float')

In [71]:
df['BasePay'].mean()

66325.44884050643

In [53]:
#6. What is the highest amount of OvertimePay in the dataset ?

In [73]:
df['OvertimePay']=df['OvertimePay'].astype('float')

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148648 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  object
 6   Benefits          112491 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(5), int64(2), object(6)
memory usage: 14.7+ MB

In [75]:
df['OvertimePay'].max()

245131.88

In [54]:
#7. What is the job title of JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer 
#that doesn't match up (there is also a lowercase Joseph Driscoll).

In [76]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [55]:
#8. How much does JOSEPH DRISCOLL make (including benefits)?

In [77]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [56]:
#9. What is the name of highest paid person (including benefits)?

In [80]:
df[df['TotalPayBenefits']== df['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [57]:
#10. What is the name of lowest paid person (including benefits)? Do you notice something strange 
#about how much he or she is paid?

In [81]:
df[df['TotalPayBenefits']== df['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [58]:
#11. What was the average (mean) BasePay of all employees per year? (2011-2014) ?

In [82]:
df.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [59]:
#12. How many unique job titles are there?

In [83]:
df['JobTitle'].nunique()

2158

In [60]:
#13. What are the top 5 most common jobs

In [84]:
df['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [61]:
#14. How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only 
#one occurence in 2013?)

In [85]:
sum(df[df['Year']==2013]['JobTitle'].value_counts() == 1)

202

In [62]:
#15. How many people have the word Chief in their job title?

In [98]:
chief_count = df[df['JobTitle'].str.contains('Chief', case=False, na=False)].shape[0]
print(f'Total people with "Chief" in their job title: {chief_count}')

Total people with "Chief" in their job title: 627

In [99]:
print(df[df['JobTitle'].str.contains('Chief', case=False, na=False)])

            Id         EmployeeName  \
4            5      PATRICK GARDNER
5            6       DAVID SULLIVAN
6            7            ALSON LEE
8            9       MICHAEL MORRIS
9           10   JOANNE HAYES-WHITE
...        ...                  ...
138011  138012     Sharon C Jackson
139620  139621          Anita S Lee
139709  139710     George D Vaughan
140080  140081  Patrick W Gillespie
140156  140157  Christopher L Ochoa

                                            JobTitle    BasePay  OvertimePay  \
4       DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)  134401.60      9737.00
5                          ASSISTANT DEPUTY CHIEF II  118602.00      8601.00
6                 BATTALION CHIEF, (FIRE DEPARTMENT)   92492.01     89062.90
8                 BATTALION CHIEF, (FIRE DEPARTMENT)  176932.64     86362.68
9             CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)  285262.00         0.00
...                                              ...        ...          ...
138011                Chief Deputy Adlt Probation Of   56660.18         0.00
139620                                   Chief Clerk   38598.86         0.00
139709                      Chief Nursery Specialist   27319.47       483.90
140080                              Chief Preparator   24091.00         0.00
140156                     Chief Stationary Engineer   24392.00       418.71

         OtherPay  Benefits   TotalPay  TotalPayBenefits  Year  Notes  \
4       182234.59       NaN  326373.19         326373.19  2011    NaN
5       189082.74       NaN  316285.74         316285.74  2011    NaN
6       134426.14       NaN  315981.05         315981.05  2011    NaN
8        40132.23       NaN  303427.55         303427.55  2011    NaN
9        17115.73       NaN  302377.73         302377.73  2011    NaN
...           ...       ...        ...               ...   ...    ...
138011       0.00    566.61   56660.18          57226.79  2014    NaN
139620       0.00    386.00   38598.86          38984.86  2014    NaN
139709       0.00  10334.67   27803.37          38138.04  2014    NaN
140080       0.00  10176.77   24091.00          34267.77  2014    NaN
140156       0.00   8918.44   24810.71          33729.15  2014    NaN

               Agency Status
4       San Francisco    NaN
5       San Francisco    NaN
6       San Francisco    NaN
8       San Francisco    NaN
9       San Francisco    NaN
...               ...    ...
138011  San Francisco     PT
139620  San Francisco     PT
139709  San Francisco     PT
140080  San Francisco     PT
140156  San Francisco     PT

[627 rows x 13 columns]

In [102]:
df_chief = df[df['JobTitle'].str.contains('Chief', case=False, na=False)]
df_chief.to_csv('chief_titles.csv', index=False)

In [ ]:
#16. Is there a correlation between length of the Job Title string and Salary

In [103]:
df['TitleLength'] = df['JobTitle'].apply(len)

TypeError: object of type 'float' has no len()

In [104]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [105]:
correlation = df['TitleLength'].corr(df['Salary'])
print(f'Correlation between Title Length and Salary: {correlation}')

KeyError: 'TitleLength'

In [106]:
import matplotlib.pyplot as plt

plt.scatter(df['TitleLength'], df['Salary'])
plt.title('Title Length vs Salary')
plt.xlabel('Title Length')
plt.ylabel('Salary')
plt.show()

KeyError: 'TitleLength'